1IDCAMS  SYSTEM SERVICES                                           TIME: 09:18:23        02/04/26     PAGE      1
0
   DELETE Z88436.CUSTINFO.VSAM
0IDC0550I ENTRY (D) Z88436.CUSTINFO.VSAM.DATA DELETED
0IDC0550I ENTRY (I) Z88436.CUSTINFO.VSAM.INDEX DELETED
0IDC0550I ENTRY (C) Z88436.CUSTINFO.VSAM DELETED
0IDC0001I FUNCTION COMPLETED, HIGHEST CONDITION CODE WAS 0
0
   SET MAXCC=0

   DEFINE CLUSTER ( NAME ( Z88436.CUSTINFO.VSAM   ) -
             VOLUME(VPWRKB) -
             TRACKS(25 10) -
             RECORDSIZE(77,77) -
             INDEXED KEYS(10 0) -
             FREESPACE(10 10) -
             REUSE -
             SHAREOPTIONS(2 3) -
             CONTROLINTERVALSIZE(4096) )
0IGD01007I ZXPACS: Z88436.CUSTINFO.VSAM
 IGD01007I ZXPACS: ALLOCATION SIZE LIMIT EXCEEDED (>250KB)
 IGD01007I ZXPACS: ALLOCATION SIZE NEEDS TO BE REDUCED - ZXP SAYS NO
 IGD01008I ZXPACS: Z88436.CUSTINFO.VSAM
 IGD01008I ZXPACS: ALLOCATION SIZE REDUCED - ZXP SAYS NO
0IDC0508I DATA ALLOCATION STATUS FOR VOLUME ZXPC02 IS 0
0IDC0509I INDEX ALLOCATION STATUS FOR VOLUME ZXPC02 IS 0
0IDC0512I NAME GENERATED-(D) Z88436.CUSTINFO.VSAM.DATA
0IDC0512I NAME GENERATED-(I) Z88436.CUSTINFO.VSAM.INDEX
 IDC0181I STORAGECLASS USED IS ZXPS
 IDC0181I DATACLASS USED IS ZXPDX
0IDC0001I FUNCTION COMPLETED, HIGHEST CONDITION CODE WAS 0
0
0IDC0002I IDCAMS PROCESSING COMPLETE. MAXIMUM CONDITION CODE WAS 0
